### PANDAS - 4SF20CI002

### --------------------ABHIJITH MALLYA --------------------

### Importing Pandas library

In [6]:
import pandas as pd

### Creating a Pandas Series

In [9]:
series = pd.Series([1,2,3,4,5])

### Creating a Pandas DataFrame

In [11]:
data = {'Name': ['John', 'Emily', 'Michael'],
        'Age': [25, 30, 35],
        'City': ['New York', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)

### Viewing the first few rows of a DataFrame

In [13]:
df.head()

      Name  Age         City
0     John   25     New York
1    Emily   30  Los Angeles
2  Michael   35      Chicago

### Accessing a column in a DataFrame

In [15]:
df['City']

0       New York
1    Los Angeles
2        Chicago
Name: City, dtype: object

### Filtering Rows based  on a condition

In [21]:
filtered_df = df[df['Age'] > 30]
filtered_df

      Name  Age     City
2  Michael   35  Chicago

In [ ]:
### Sorting a DataFrame by a Column

In [26]:
sorted_df = df.sort_values('Age')
sorted_df

      Name  Age         City
0     John   25     New York
1    Emily   30  Los Angeles
2  Michael   35      Chicago

In [27]:
### Performing statistical calculations in a Column

In [29]:
average_age = df['Age'].mean()
print("Average age :"+str(average_age))

Average age :30.0

In [30]:
### Adding a new Column to a DataFrame

In [31]:
df['Gender'] = ['Male', 'Female', 'Male']

In [32]:
### Grouping and agregating data in a DataFrame

In [33]:
grouped_df = df.groupby('Gender').mean()
grouped_df

C:\Users\ABHIJITH_MALLYA\AppData\Local\Temp\ipykernel_21404\4092285472.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped_df = df.groupby('Gender').mean()

         Age
Gender
Female  30.0
Male    30.0

### --------------------ABHIJITH MALLYA --------------------